#**Задания:**

#- **Задание #1**
    #- Создайте переменные `x` со значением `10.5` и `y` со значением `3.2`.
    #- Выполните следующие операции и выведите результат каждой:
       # - Сложение `x + y`
       # - Вычитание `x - y`
       # - Умножение `x * y`
        #- Деление `x / y`
        #- Возведение `x` в степень `y` (используйте оператор `**`)

x = 10.5

y = 3.2

print(x + y)
print(x - y)
print(x * y)
print(x / y)
print(x ** y)
#- **Задание #2**
    #- Создайте переменную `price` со значением `19.99`.
    #- Создайте переменную `quantity` со значением `3`.
    #- Найдите итоговую стоимость, умножив `price` на `quantity`, и сохраните результат в переменную `total`.
    #- Выведите `total`, чтобы проверить результат.
price = 19.99
quantity = 3

total = price * quantity

print(total)


#- **Задание #3**
    #- Создайте переменную `radius` со значением `7.5`.
    #- Найдите площадь круга с данным радиусом, используя формулу `area = 3.14159 * radius ** 2`.
    #- Сохраните результат в переменную `area` и выведите её.

radius = 7.5
area = 3.14159 * radius ** 2
print(area)

#- **Задание #4**
   # - Создайте переменную `weight_kg` со значением `75.8`.
   # - Переведите её в фунты (1 кг = 2.20462 фунта) и сохраните результат в переменную `weight_lb`.
    #- Выведите `weight_lb`, чтобы проверить перевод.
weight_kg = 75.8
weight_lb = 75.8 / 2.20462

print(weight_lb)