#- **Задание #1**
    #- Создайте переменную `x` со значением `25` и `y` со значением `4`.
    #- Выполните следующие операции и выведите результат каждой:
       # - Сложение `x + y`
        #- Вычитание `x - y`
        #- Умножение `x * y`
        #- Деление `x / y` (с сохранением дробной части)
        #- Деление `x // y` (целочисленное деление)
        #- Остаток от деления `x % y`

x = 25
y = 4

print(x + y)
print(x - y)
print(x * y)
print(x / y)
print(x // y)
print(x % y)







#- **Задание #2**
    #- Создайте переменную `num` со значением `15`.
    #- Увеличьте значение `num` на `10` и сохраните результат обратно в `num`.
    #- Уменьшите `num` на `5` и снова сохраните результат в `num`.
    #- Выведите итоговое значение `num` и проверьте результат.

num = 15


num = num +10
num = num -5
print(num)