#- **Задание #1**
    #1. Создайте переменную `my_variable` и присвойте ей значение `None`.
    #2. Выведите значение этой переменной с помощью `print()`.
my_variable = None

print("Значение переменной:", my_variable)