#- **Задание #1**
    #1. Создайте переменную `is_sunny` и присвойте ей значение `True` (например, солнечная погода).
    #2. Создайте переменную `is_raining` и присвойте ей значение `False` (например, дождя нет).
    #3. Напечатайте обе переменные с помощью функции `print()`.
is_sunny = True
is_raining = False

print(is_sunny, is_raining)


#- **Задание #2**
    #1. Создайте переменную `age` и присвойте ей значение `18`.
    #2. Создайте переменную `is_adult` и присвойте ей значение `True`, если возраст больше или равен 18. (Пока без операторов, просто явно укажите значение.)
    #3. Напечатайте переменную `is_adult`.


age = 18
is_adult = True

print(is_adult)