### **Задание #1**

#1. Создайте переменную `is_logged_in` и установите значение `True` или `False`.
#2. Создайте переменную `needs_login`, которая будет равна `True`, если `is_logged_in` равно `False`. Используйте оператор `not`.
#3. Выведите результат `needs_login`.

is_logged_in = False

needs_login = not is_logged_in

print(needs_login)



### **Задание #2**

#1. Создайте переменную `is_empty`, которая обозначает, что контейнер пуст, и установите значение `True` или `False`.
#2. Создайте переменную `has_items`, которая будет равна `True`, если `is_empty` равно `False`. Используйте оператор `not`.
#3. Проверьте результат `has_items`, выводя его на экран.


is_empty = False

has_items = not is_empty

print(has_items)