# ### **Задание #1**
#
# 1. Создайте переменные `number1` и `number2` с различными числовыми значениями.
# 2. Проверьте, не равны ли значения `number1` и `number2`, используя `assert` и оператор `!=`
# 3. Выведите результат проверки

number1 = 44
number2 = 23

assert number1 != number2
print("vse ok")
# ### **Задание #2**
#
# 1. Сделай переменную с числовым значением > 0
# 2. В `print()` передай в качестве аргумента выражение, где переменная будет сравниваться с `False` путем оператора `!=`

kek = 3
print(kek != False)