# ### **Задание #1**
#
# 1. Создайте две переменные `age_person1` и `age_person2` с разными значениями возрастов.
# 2. Проверьте, является ли `age_person1` больше, чем `age_person2`, используя оператор `>`.
# 3. Выведите результат проверки.

age_person1 = 55
age_person2 = 655
print(age_person2 > age_person1)

# ### **Задание #2**
#
# 1. Создайте переменные `height1` и `height2` для хранения роста двух человек (в сантиметрах).
# 2. Проверьте, меньше ли `height1`, чем `height2`, используя оператор `<`.
# 3. Выведите результат проверки.

height1 = 11
height2 = 22

print(height1 < height2)
# ### **Задание #3**
#
# 1. Создайте переменную `temperature` со значением текущей температуры на улице и переменную `freezing_point` со значением 0.
# 2. Используйте оператор `>=`, чтобы проверить, выше или равна ли `temperature` точке замерзания (`freezing_point`).
# 3. Выведите результат проверки, чтобы определить, является ли температура на улице выше или ниже точки замерзания.

temperature = 22

freezing_point = 0

print( freezing_point >= temperature)


# ### **Задание #4**

x = 3
print(3 >= True)

# 1. Запиши в переменную целое число, которое больше 1. (например 2 или 3)
# 2. Попробуй сравнить, больше ли эта переменная, чем True?
# 3. Результат выведи при помощи `print()`