#- Задание#1Создайте переменную а в ней строку с разными ковычками
# с одинарными и двойными, нужно создать 2 переменные

abobus = "lfs"
kek = 'df'

#- Задание  # 2

#складывать(конкатенировать), используя
#оператор ** `+` **

#сложите 2 строки из разных переменных и выведите через `print`

abobus = "lfs"
kek = 'df'
print(abobus + kek)




#- Задание#3
    #1. Сделать 2 переменные с текстом, но чтобы 1 переменная входила внутрь другой при помощи f-string
    #2. Вывести результат при помощи `print()`

abobus = "test"
kek = 'df'
print(abobus + kek)





# Создаём две переменные
text1 = "Иллидан"
text2 = "и она входит внутрь второй"

# Используем f-string
result = f"Ваш герой погиб{text1}, {text2}."

result2 = f"Герой ваших союзников убит {text1}"
# Выводим результат
print(result2)


